#**Trabalhando com Planilhas do Excel**

In [1]:
#Importando a biblioteca
import pandas as pd

In [18]:
#Leitura dos arquivos
df1 = pd.read_excel("../datasets/Aracaju.xlsx")
df2 = pd.read_excel("../datasets/Fortaleza.xlsx")
df3 = pd.read_excel("../datasets/Natal.xlsx")
df4 = pd.read_excel("../datasets/Recife.xlsx")
df5 = pd.read_excel("../datasets/Salvador.xlsx")

In [5]:
#VISUALIZAR AS PRIMEIRAS 5 LINHAS
df5.head()

     Cidade       Data  Vendas  LojaID  Qtde
0  Salvador 2018-01-01   31.06    1037     3
1  Salvador 2018-01-01   19.02    1034     3
2  Salvador 2019-02-10  173.59    1035     3
3  Salvador 2019-02-10  176.34    1037     3
4  Salvador 2019-02-14   19.47    1037     3

In [19]:
#juntando todos os arquivos
df = pd.concat([df1,df2,df3,df4,df5])

In [9]:
#Exibindo as 5 primeiras linhas
df.head()

     Cidade       Data  Vendas  LojaID  Qtde
0   Aracaju 2018-01-01  142.00    1520     1
1   Aracaju 2018-01-01   14.21    1522     6
2   Aracaju 2018-01-01   71.55    1520     1
3   Aracaju 2018-01-01    3.01    1521     7
4   Aracaju 2018-01-01   24.51    1522     8
..      ...        ...     ...     ...   ...
95  Aracaju 2018-01-01  127.43    1522     9
96  Aracaju 2018-01-01   85.92    1521     2
97  Aracaju 2018-01-01   32.69    1521     5
98  Aracaju 2018-01-01  138.33    1521    10
99  Aracaju 2018-01-01  139.32    1521     3

[100 rows x 5 columns]

In [54]:
#Exibindo as 5 últimas linhas
df.tail()

       Cidade       Data  Vendas  LojaID  Qtde
235  Salvador 2019-01-03   41.84    1034     1
236  Salvador 2019-01-03  126.29    1035     3
237  Salvador 2019-01-03   38.06    1036     3
238  Salvador 2019-01-03  139.64    1035     1
239  Salvador 2019-01-03  161.41    1037     3

In [10]:
# MOSTRAR UMA AMOSTRA DO DF
# CADA VEZ QUE EXECUTA MOSTRAM DADOS DIFERENTES
df.sample(5)

        Cidade       Data  Vendas  LojaID  Qtde
89      Recife 2019-01-01   18.11     980     3
130  Fortaleza 2019-03-02   12.36     983     4
47       Natal 2018-03-13  521.00     854     3
183      Natal 2019-01-02  120.23    1037     2
9      Aracaju 2019-01-01  149.36    1523     3

In [11]:
#Verificando o tipo de dado de cada coluna
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID             int64
Qtde               int64
dtype: object

In [13]:
#Alterando o tipo de dado da coluna LojaID
# ALTEROU O ID PARA OBJETO POIS NÃO SERÁ FEITO NENHUM CÁLCULO COM ELE
df["LojaID"] = df["LojaID"].astype("object")

In [14]:
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID            object
Qtde               int64
dtype: object

In [15]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde
0  Aracaju 2018-01-01  142.00   1520     1
1  Aracaju 2018-01-01   14.21   1522     6
2  Aracaju 2018-01-01   71.55   1520     1
3  Aracaju 2018-01-01    3.01   1521     7
4  Aracaju 2018-01-01   24.51   1522     8

**Tratando valores faltantes**

In [20]:
#Consultando linhas com valores faltantes
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [ ]:
#Substituindo os valores nulos pela média
# INPLACE= TRUE É PARA SUBSTITUIR EM MEMÓRIA NÃO APENAS NESTA LINHA DE CÓDIGO
df["Vendas"].fillna(df["Vendas"].mean(), inplace=True)

In [ ]:
# ACIMA SUBSTITUIA PELA MEDIA, AQUI SUBSTITUI OS VAZIOS POR ZERO
df["Vendas"].fillna(0, inplace=True)

In [17]:
df["Vendas"].mean()

122.61180089485458

In [70]:
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [65]:
df.sample(15)

        Cidade       Data  Vendas LojaID  Qtde
216   Salvador 2019-01-02    5.82   1035     1
224      Natal 2019-01-02  178.30   1035     3
34      Recife 2019-01-01   24.97    980     5
74      Recife 2019-01-01   38.79    983     6
193      Natal 2019-01-02    3.97   1036     2
136      Natal 2019-01-02   13.81   1036     1
113  Fortaleza 2019-03-02   38.63    980     2
64   Fortaleza 2019-01-01  110.31   1005     4
121    Aracaju 2018-01-01  162.07   1520     3
6      Aracaju 2018-01-01   35.50   1522     2
118      Natal 2019-01-02   92.21   1035     2
10      Recife 2019-01-01   38.51    982     8
41     Aracaju 2018-01-01  229.64   1520     8
130  Fortaleza 2019-03-02   12.36    983     4
130   Salvador 2019-03-02   59.78   1036     1

In [ ]:
#Substituindo os valores nulos por zero
df["Vendas"].fillna(0, inplace=True)

In [ ]:
#Apagando as linhas com valores nulos
df.dropna(inplace=True)

In [ ]:
#Apagando as linhas com valores nulos com base apenas em 1 coluna
df.dropna(subset=["Vendas"], inplace=True)

In [ ]:
#Removendo linhas que estejam com valores faltantes em todas as colunas
df.dropna(how="all", inplace=True)

**Criando colunas novas**

In [23]:
#Criando a coluna de receita
df["Receita"] = df["Vendas"].mul(df["Qtde"])

In [22]:
df.head()

    Cidade       Data  Vendas  LojaID  Qtde
0  Aracaju 2018-01-01  142.00    1520     1
1  Aracaju 2018-01-01   14.21    1522     6
2  Aracaju 2018-01-01   71.55    1520     1
3  Aracaju 2018-01-01    3.01    1521     7
4  Aracaju 2018-01-01   24.51    1522     8

In [24]:
df["Receita/Vendas"] = df["Receita"] / df["Vendas"]

In [74]:
df.head()

    Cidade       Data  Vendas  LojaID  Qtde  Receita  Receita/Vendas
0  Aracaju 2018-01-01  142.00    1520     1   142.00             1.0
1  Aracaju 2018-01-01   14.21    1522     6    85.26             6.0
2  Aracaju 2018-01-01   71.55    1520     1    71.55             1.0
3  Aracaju 2018-01-01    3.01    1521     7    21.07             7.0
4  Aracaju 2018-01-01   24.51    1522     8   196.08             8.0

In [26]:
#Retornando a maior receita
df["Receita"].max()

3544.0

In [27]:
#Retornando a menor receita
df["Receita"].min()

3.34

In [28]:
#nlargest
# RETORNA O TOP NO CASO 3
df.nlargest(3, "Receita")

   Cidade       Data  Vendas  LojaID  Qtde  Receita  Receita/Vendas
7   Natal 2019-03-18   886.0     853     4   3544.0             4.0
51  Natal 2018-01-21   859.0     852     4   3436.0             4.0
55  Natal 2019-01-08   859.0     854     4   3436.0             4.0

In [29]:
#nsamllest
#RETORNA OS TOP MENORES
df.nsmallest(3, "Receita")

      Cidade       Data  Vendas  LojaID  Qtde  Receita  Receita/Vendas
118  Aracaju 2018-01-01    3.34    1522     1     3.34             1.0
65    Recife 2019-01-01    4.01     981     1     4.01             1.0
92     Natal 2019-01-02    4.57    1035     1     4.57             1.0

In [30]:
#Agrupamento por cidade e somando as receitas delas
df.groupby("Cidade")["Receita"].sum()

Cidade
Aracaju       48748.25
Fortaleza     37913.97
Natal        167227.52
Recife        51936.51
Salvador      40596.73
Name: Receita, dtype: float64

In [31]:
#Ordenando o conjunto de dados pela coluna Receita
df.sort_values("Receita", ascending=False).head(10)

   Cidade       Data  Vendas  LojaID  Qtde  Receita  Receita/Vendas
7   Natal 2019-03-18   886.0     853     4   3544.0             4.0
55  Natal 2019-01-08   859.0     854     4   3436.0             4.0
51  Natal 2018-01-21   859.0     852     4   3436.0             4.0
30  Natal 2018-10-02   856.0     853     4   3424.0             4.0
41  Natal 2018-05-20   835.0     852     4   3340.0             4.0
38  Natal 2018-02-25   828.0     852     4   3312.0             4.0
10  Natal 2018-10-27   828.0     852     4   3312.0             4.0
69  Natal 2019-03-24   817.0     852     4   3268.0             4.0
62  Natal 2018-02-10   793.0     854     4   3172.0             4.0
52  Natal 2018-04-27   778.0     854     4   3112.0             4.0

#**Trabalhando com datas**

In [ ]:
#Trasnformando a coluna de data em tipo inteiro
df["Data"] = df["Data"].astype("int64")

In [127]:
#Verificando o tipo de dado de cada coluna
df.dtypes

Cidade             object
Data                int64
Vendas            float64
LojaID             object
Qtde                int64
Receita           float64
Receita/Vendas    float64
dtype: object

In [ ]:
#Transformando coluna de data em data
df["Data"] = pd.to_datetime(df["Data"])

In [129]:
df.dtypes

Cidade                    object
Data              datetime64[ns]
Vendas                   float64
LojaID                    object
Qtde                       int64
Receita                  float64
Receita/Vendas           float64
dtype: object

In [130]:
#Agrupamento por ano
df.groupby(df["Data"].dt.year)["Receita"].sum()

Data
2018    118176.53
2019    226454.71
Name: Receita, dtype: float64

In [32]:
#Criando uma nova coluna com o ano
df["Ano_Venda"] = df["Data"].dt.year

In [33]:
df.sample(5)

,Cidade,Data,Vendas,LojaID,Qtde,Receita,Receita/Vendas,Ano_Venda
201,Natal,2019-01-02,86.61,1036,1,86.61,1.0,2019
138,Salvador,2019-03-02,212.03,1037,3,636.09,3.0,2019
20,Natal,2018-06-08,608.00,852,4,2432.00,4.0,2018
34,Salvador,2019-01-01,36.54,1037,3,109.62,3.0,2019
84,Natal,2019-01-02,22.99,1036,1,22.99,1.0,2019

In [34]:
#Extraindo o mês e o dia
df["mes_venda"], df["dia_venda"] = (df["Data"].dt.month, df["Data"].dt.day)

In [35]:
df.sample(5)

,Cidade,Data,Vendas,LojaID,Qtde,Receita,Receita/Vendas,Ano_Venda,mes_venda,dia_venda
134,Salvador,2019-03-02,125.90,1036,1,125.90,1.0,2019,3,2
59,Recife,2019-01-01,89.39,983,5,446.95,5.0,2019,1,1
68,Aracaju,2018-01-01,179.74,1520,2,359.48,2.0,2018,1,1
99,Natal,2019-01-02,40.38,1037,1,40.38,1.0,2019,1,2
166,Natal,2019-01-02,111.72,1035,3,335.16,3.0,2019,1,2

In [36]:
#Retornando a data mais antiga
df["Data"].min()

Timestamp('2018-01-01 00:00:00')

In [37]:
#Calculando a diferença de dias
df["diferenca_dias"] = df["Data"] - df["Data"].min()

In [38]:
df.sample(5)

,Cidade,Data,Vendas,LojaID,Qtde,Receita,Receita/Vendas,Ano_Venda,mes_venda,dia_venda,diferenca_dias
22,Salvador,2019-01-01,32.57,1035,1,32.57,1.0,2019,1,1,365 days
147,Salvador,2019-01-02,34.50,1035,1,34.50,1.0,2019,1,2,366 days
30,Aracaju,2018-01-01,119.21,1520,8,953.68,8.0,2018,1,1,0 days
91,Aracaju,2018-01-01,200.85,1522,6,1205.10,6.0,2018,1,1,0 days
161,Natal,2019-01-02,5.80,1036,1,5.80,1.0,2019,1,2,366 days

In [39]:
#Criando a coluna de trimestre
df["trimestre_venda"] = df["Data"].dt.quarter

In [43]:
df.sample(5)

,Cidade,Data,Vendas,LojaID,Qtde,Receita,Receita/Vendas,Ano_Venda,mes_venda,dia_venda,diferenca_dias,trimestre_venda
77,Aracaju,2018-01-01,24.10,1522,1,24.10,1.0,2018,1,1,0 days,1
33,Salvador,2019-01-01,144.19,1035,2,288.38,2.0,2019,1,1,365 days,1
65,Natal,2019-04-05,292.00,852,2,584.00,2.0,2019,4,5,459 days,2
115,Natal,2019-01-02,202.33,1035,2,404.66,2.0,2019,1,2,366 days,1
35,Salvador,2019-01-01,241.45,1037,1,241.45,1.0,2019,1,1,365 days,1

In [44]:
#Filtrando as vendas de 2019 do mês de março
vendas_marco_19 = df.loc[(df["Data"].dt.year == 2019) & (df["Data"].dt.month == 3)]

In [45]:
vendas_marco_19.sample(20)

,Cidade,Data,Vendas,LojaID,Qtde,Receita,Receita/Vendas,Ano_Venda,mes_venda,dia_venda,diferenca_dias,trimestre_venda
132,Recife,2019-03-02,17.49,983,5,87.45,5.0,2019,3,2,425 days,1
118,Salvador,2019-03-02,92.21,1035,2,184.42,2.0,2019,3,2,425 days,1
2,Natal,2019-03-11,308.00,852,3,924.00,3.0,2019,3,11,434 days,1
114,Fortaleza,2019-03-02,16.82,983,4,67.28,4.0,2019,3,2,425 days,1
18,Natal,2019-03-14,581.00,853,3,1743.00,3.0,2019,3,14,437 days,1
128,Recife,2019-03-02,38.70,982,4,154.80,4.0,2019,3,2,425 days,1
126,Fortaleza,2019-03-02,41.87,980,8,334.96,8.0,2019,3,2,425 days,1
139,Salvador,2019-03-02,169.01,1036,1,169.01,1.0,2019,3,2,425 days,1
110,Recife,2019-03-02,51.98,983,6,311.88,6.0,2019,3,2,425 days,1
132,Fortaleza,2019-03-02,17.49,983,5,87.45,5.0,2019,3,2,425 days,1
125,Fortaleza,2019-03-02,37.60,983,4,150.40,4.0,2019,3,2,425 days,1
75,Natal,2019-03-30,706.00,854,2,1412.00,2.0,2019,3,30,453 days,1
130,Recife,2019-03-02,12.36,983,4,49.44,4.0,2019,3,2,425 days,1
128,Fortaleza,2019-03-02,38.70,982,4,154.80,4.0,2019,3,2,425 days,1
134,Salvador,2019-03-02,125.90,1036,1,125.90,1.0,2019,3,2,425 days,1
122,Salvador,2019-03-02,13.27,1037,1,13.27,1.0,2019,3,2,425 days,1
131,Salvador,2019-03-02,63.48,1037,3,190.44,3.0,2019,3,2,425 days,1
19,Natal,2019-03-31,282.00,854,2,564.00,2.0,2019,3,31,454 days,1
135,Salvador,2019-03-02,9.95,1037,3,29.85,3.0,2019,3,2,425 days,1
128,Salvador,2019-03-02,36.84,1034,1,36.84,1.0,2019,3,2,425 days,1